ZigZagT/FreeCopter/src/wrapper/device/m0518sd2ae/main.c
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <wcp-wrapper.h>
#include "wcp-helper.h"
#include "M0518.h"
#include "define.h"
#include "i2c_rw.h"
#include "pwm-helper.h"

// #define DEBUG                       1

double PWM_Cycle_Per_US;
int PWM_NS_Per_Cycle;

int PWM_Cycle_Per_Period;
int PWM_Cycle_Low_Bound;
int PWM_Cycle_Hi_Bound;
int PWM_Cycle_Per_Period_Limit;
int PWM_Cycle_Low_Bound_Limit;
int PWM_Cycle_Hi_Bound_Limit;

I2C_SEND_T I2C_Send_Control;
I2C_RECV_T I2C_Recv_Control;

uint32_t buf_cap = 200;
uint32_t buf_len = 200;
uint8_t buf[200];

void PWM0_IRQHandler(void);
void PWM1_IRQHandler(void);
void I2C0_IRQHandler(void);
void SYS_Init(void);
void PWM_INIT( void );
void I2C_RESET(void);
void I2C_INIT(void);
void I2C_Slave_Go(I2C_T* port, uint32_t status);
void fc_log(char* msg);

#if defined(DEBUG)
unsigned PWM0_COUNTER = 0;
unsigned PWM0_COUNTER_LIMIT;
void draw_graph(int* arr, int n) {
    int max = 0;
    int temp;
    static char buf[100] = "";

    // printf("\tarray dump: \n\tn=%d\n", n);
    for (temp = 0; temp < n; ++temp) {
    //   printf("arr[%d] = \t%d\n", temp, arr[temp]);
        if (arr[temp] > max) {
            max = arr[temp];
        }
        buf[2 * temp] = '\t';
    }
    // putchar('\n');
    buf[2 * temp] = '\0';
    buf[2 * temp + 1] = '\0';

    while (max > 0) {
        for (temp = 0; temp < n; ++temp) {
            if (arr[temp] >= max) {
                buf[2 * temp + 1] = '*';
            } else {
                buf[2 * temp + 1] = ' ';
            }
        }
        printf("%s\t| max= %d\n", buf, max);
        max -= 1;
    }
    for (temp = 0; temp < n; ++temp) {
        printf("\t%d", arr[temp]);
    }
    putchar('\n');
    for (temp = 0; temp < n * 9; ++temp) {
        putchar('-');
    }
    putchar('\n');
    putchar('\n');
}

#endif

void PWM0_IRQHandler(void) {
    Disable_PWM0_INT();
    PWM0->CAPIF = 0x3f3f;

    uint32_t index;
    uint32_t falling_data, rising_data;
    uint32_t high_period, low_period, total_period;

    for (   index = 0;
            index < 6;
            index += 2   ) {

        falling_data = PWM_GET_CAPTURE_FALLING_DATA(PWM0, index);
        rising_data = PWM_GET_CAPTURE_RISING_DATA(PWM0, index);
        high_period = rising_data - falling_data;
        low_period = 0x10000 - rising_data;
        total_period = high_period + low_period;
        int value1000 = ((high_period - PWM_Cycle_Low_Bound) * 1000) / (PWM_Cycle_Hi_Bound - PWM_Cycle_Low_Bound);
        if (pwm_channel_value_check_dither((index / 2), value1000) == 0) {
            if (high_period < PWM_Cycle_Low_Bound && high_period >= PWM_Cycle_Low_Bound_Limit) {
                PWM_Cycle_Low_Bound = high_period;
            }
            if (high_period > PWM_Cycle_Hi_Bound && high_period <= PWM_Cycle_Hi_Bound_Limit) {
                PWM_Cycle_Hi_Bound = high_period;
            }
            if (total_period > PWM_Cycle_Per_Period && total_period <= PWM_Cycle_Per_Period_Limit) {
                PWM_Cycle_Per_Period = total_period;
            }

            if(high_period >= PWM_Cycle_Low_Bound && high_period <= PWM_Cycle_Hi_Bound) {
                FREECOPTER_WCP_CHANNEL_T * channel = &fc_wcp_status_channels.channel[index / 2];
                BPWM_SET_CNR(BPWM0, index, PWM_Cycle_Per_Period);
                if (channel->signal_source == FREECOPTER_WCP_CHANNEL_SIGSOURCE_CONTROLLED) {
                    BPWM_SET_CMR(BPWM0, index, (channel->value * (PWM_Cycle_Hi_Bound - PWM_Cycle_Low_Bound)) / 1000 + PWM_Cycle_Low_Bound);
                } else {
                    BPWM_SET_CMR(BPWM0, index, high_period);
                    channel->value = value1000;
                }

            }
        }
    }
    Enable_PWM0_INT();
}

/*
// void PWM0_IRQHandler(void) {
//     Disable_PWM0_INT();
//     //int capture_int_flag = PWM0->CAPIF & 0x3f3f;
//     #if defined(DEBUG)
//     if (PWM0_COUNTER > PWM0_COUNTER_LIMIT) {
//         printf("PWM0 IRQ on %x\n", capture_int_flag);
//     }
//     #endif
//     PWM0->CAPIF = 0x3f3f;
//     //capture_int_flag >>= 8;

//     unsigned int index, bitflag;
//     unsigned int falling_data, rising_data;
//     unsigned int high_period, low_period, total_period;

//     #if defined(DEBUG)
//     static int level[6] = {0, 0, 0, 0, 0, 0};
//         PWM0_COUNTER_LIMIT = 4 * (1000000 / PWM_PERIOD_US);
//         //printf("INT!\n");

//         // if (PWM0_COUNTER > PWM0_COUNTER_LIMIT) {
//         //     printf("BPWM STATUS:\n");
//         //     for (int index = 0; index < 6; ++index) {
//         //         printf(
//         //             "\tCH %d: \t%dus\tof\t%dus\n",
//         //             index,
//         //             BPWM_GET_CMR(BPWM0, index) / PWM_Cycle_Per_US,
//         //             BPWM_GET_CNR(BPWM0) / PWM_Cycle_Per_US
//         //         );
//         //     }
//         //     printf("\n");
//         // }
//     #endif

//     for (   index = 0, bitflag = 1;
//             index < 6; // && capture_int_flag & bitflag;
//             index += 2, bitflag <<= 2   ) {
//     // index = 0;
//     // bitflag = 1;
//     // while(index < 6 && capture_int_flag & bitflag) {

//         falling_data = PWM_GET_CAPTURE_FALLING_DATA(PWM0, index);
//         rising_data = PWM_GET_CAPTURE_RISING_DATA(PWM0, index);
//         high_period = rising_data - falling_data;
//         low_period = 0x10000 - rising_data;
//         total_period = high_period + low_period;
//         if (high_period < PWM_Cycle_Low_Bound && high_period >= PWM_Cycle_Low_Bound_Limit) {
//             PWM_Cycle_Low_Bound = high_period;
//         }
//         if (high_period > PWM_Cycle_Hi_Bound && high_period <= PWM_Cycle_Hi_Bound_Limit) {
//             PWM_Cycle_Hi_Bound = high_period;
//         }
//         if (total_period > PWM_Cycle_Per_Period && total_period <= PWM_Cycle_Per_Period_Limit) {
//             PWM_Cycle_Per_Period = total_period;
//         }

//         #if defined(DEBUG)
//         if (PWM0_COUNTER > PWM0_COUNTER_LIMIT) {
//             printf(
//                 "PWM0 CH %d \tRD: %d/%dus, \t\tFD: %d/%dus\n\t\t\tHP: %d/%dus, \t\tLP: %d/%dus\n\n",
//                 index,
//                 rising_data,
//                 rising_data / PWM_Cycle_Per_US,
//                 falling_data,
//                 falling_data / PWM_Cycle_Per_US,
//                 high_period,
//                 high_period / PWM_Cycle_Per_US,
//                 low_period,
//                 low_period / PWM_Cycle_Per_US
//             );
//         }
//         #endif

//         if(high_period >= PWM_Cycle_Low_Bound && high_period <= PWM_Cycle_Hi_Bound) {

