ZigZagT/FreeCopter/src/wrapper/device/m0518sd2ae/main.c
//             #if defined(DEBUG)
//             if (PWM0_COUNTER > PWM0_COUNTER_LIMIT) {
//                 printf(
//                     "BPWM CH %d output changed from %dus of %dus to %dus of %dus\n\n",
//                     index,
//                     BPWM_GET_CMR(BPWM0, index) / PWM_Cycle_Per_US,
//                     BPWM_GET_CNR(BPWM0) / PWM_Cycle_Per_US,
//                     high_period / PWM_Cycle_Per_US,
//                     PWM_Cycle_Per_Period / PWM_Cycle_Per_US
//                 );
//             }
//             #endif

//             BPWM_SET_CNR(BPWM0, index, PWM_Cycle_Per_Period);
//             BPWM_SET_CMR(BPWM0, index, high_period);
//         }

//         // index += 2;
//         // bitflag <<= 2;
//     }

//     #if defined(DEBUG)
//     if (PWM0_COUNTER > PWM0_COUNTER_LIMIT) {
//         for(temp = 0; temp < 3; ++temp) {
//             level[temp] = (BPWM_GET_CMR(BPWM0, temp * 2) / PWM_Cycle_Per_US) / 100 - 10;
//             level[temp] <<= 2;
//         }
//         for(temp = 0; temp < 3; ++temp) {
//             level[temp + 3] = (BPWM_GET_CMR(BPWM1, temp * 2) / PWM_Cycle_Per_US) / 100 - 10;
//             level[temp + 3] <<= 2;
//         }
//         draw_graph(level, 6);
//     }
//     #endif
//     #if defined(DEBUG)
//     if (PWM0_COUNTER > PWM0_COUNTER_LIMIT) {
//         PWM0_COUNTER = 0;
//     }
//     ++PWM0_COUNTER;
//     #endif
//     Enable_PWM0_INT();
// }
*/
void PWM1_IRQHandler(void) {
    Disable_PWM1_INT();
    PWM1->CAPIF = 0x3f3f;

    int index;
    int falling_data, rising_data;
    int high_period, low_period, total_period;

    for (   index = 0;
            index < 6;
            index += 2 ) {

        falling_data = PWM_GET_CAPTURE_FALLING_DATA(PWM1, index);
        rising_data = PWM_GET_CAPTURE_RISING_DATA(PWM1, index);
        high_period = rising_data - falling_data;
        low_period = 0x10000 - rising_data;
        total_period = high_period + low_period;
        int value1000 = ((high_period - PWM_Cycle_Low_Bound) * 1000) / (PWM_Cycle_Hi_Bound - PWM_Cycle_Low_Bound);
        if (pwm_channel_value_check_dither((index / 2 + 3), value1000) == 0) {
            if (high_period < PWM_Cycle_Low_Bound && high_period >= PWM_Cycle_Low_Bound_Limit) {
                PWM_Cycle_Low_Bound = high_period;
            }
            if (high_period > PWM_Cycle_Hi_Bound && high_period <= PWM_Cycle_Hi_Bound_Limit) {
                PWM_Cycle_Hi_Bound = high_period;
            }
            if (total_period > PWM_Cycle_Per_Period && total_period <= PWM_Cycle_Per_Period_Limit) {
                PWM_Cycle_Per_Period = total_period;
            }

            if(high_period >= PWM_Cycle_Low_Bound && high_period <= PWM_Cycle_Hi_Bound) {

                FREECOPTER_WCP_CHANNEL_T * channel = &fc_wcp_status_channels.channel[index / 2 + 3];
                BPWM_SET_CNR(BPWM1, index, PWM_Cycle_Per_Period);
                if (channel->signal_source == FREECOPTER_WCP_CHANNEL_SIGSOURCE_CONTROLLED) {
                    BPWM_SET_CMR(BPWM1, index, (channel->value * (PWM_Cycle_Hi_Bound - PWM_Cycle_Low_Bound)) / 1000 + PWM_Cycle_Low_Bound);
                } else {
                    BPWM_SET_CMR(BPWM1, index, high_period);
                    channel->value = value1000;
                }
            }
        }
    }
    Enable_PWM1_INT();
}

void I2C0_IRQHandler(void)
{
    uint32_t u32Status;

    u32Status = I2C_GET_STATUS(I2C0);

    if(I2C_GET_TIMEOUT_FLAG(I2C0))
    {
        printf("timeout: %d\n", u32Status);
        /* Clear I2C0 Timeout Flag */
        I2C_ClearTimeoutFlag(I2C0);
        return;
    }
    I2C_Slave_Go(I2C0, u32Status);
    return;
}

void SYS_Init(void)
{
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init System Clock                                                                                       */
    /*---------------------------------------------------------------------------------------------------------*/

    /* Enable Internal RC clock */
    CLK_EnableXtalRC(CLK_PWRCON_OSC22M_EN_Msk);

    /* Waiting for IRC22M clock ready */
    CLK_WaitClockReady(CLK_CLKSTATUS_OSC22M_STB_Msk);

    /* Switch HCLK clock source to Internal RC and HCLK source divide 1 */
    CLK_SetHCLK(CLK_CLKSEL0_HCLK_S_HIRC, CLK_CLKDIV_HCLK(1));

    /* Enable external 12MHz XTAL, internal 22.1184MHz */
    CLK_EnableXtalRC(CLK_PWRCON_XTL12M_EN_Msk | CLK_PWRCON_OSC22M_EN_Msk);

    /* Enable PLL and Set PLL frequency */
    CLK_SetCoreClock(PLL_CLOCK);

    /* Waiting for clock ready */
    CLK_WaitClockReady(CLK_CLKSTATUS_PLL_STB_Msk | CLK_CLKSTATUS_XTL12M_STB_Msk | CLK_CLKSTATUS_OSC22M_STB_Msk);

    /* Switch HCLK clock source to PLL, STCLK to HCLK/2 */
    //CLK_SetHCLK(CLK_CLKSEL0_HCLK_S_PLL, CLK_CLKDIV_HCLK(2));
    CLK_SetHCLK(CLK_CLKSEL0_HCLK_S_HXT, CLK_CLKDIV_HCLK(1));

    /* Enable UART module clock */
    CLK_EnableModuleClock(UART0_MODULE);

    /* Enable PWM module clock */
    CLK_EnableModuleClock(PWM0_MODULE);
    CLK_EnableModuleClock(PWM1_MODULE);
    CLK_EnableModuleClock(BPWM0_MODULE);
    CLK_EnableModuleClock(BPWM1_MODULE);

    /* Enable I2C0 module clock */
    CLK_EnableModuleClock(I2C0_MODULE);

    /* Select UART module clock source */
    CLK_SetModuleClock(UART0_MODULE, CLK_CLKSEL1_UART_S_HXT, CLK_CLKDIV_UART(1));

    /* Select PWM module clock source */
    CLK_SetModuleClock(PWM0_MODULE, CLK_CLKSEL3_PWM0_S_PCLK, 0);
    CLK_SetModuleClock(PWM1_MODULE, CLK_CLKSEL3_PWM1_S_PCLK, 0);
    CLK_SetModuleClock(BPWM0_MODULE, CLK_CLKSEL3_BPWM0_S_PCLK, 0);
    CLK_SetModuleClock(BPWM1_MODULE, CLK_CLKSEL3_BPWM1_S_PCLK, 0);

    /* Reset PWM */
    SYS_ResetModule(PWM0_RST);
    SYS_ResetModule(PWM1_RST);
    SYS_ResetModule(BPWM0_RST);
    SYS_ResetModule(BPWM1_RST);

    // Reset I2C
    SYS_ResetModule(I2C0_RST);

    /* Update System Core Clock */
    /* User can use SystemCoreClockUpdate() to calculate PllClock, SystemCoreClock and CycylesPerUs automatically. */
    SystemCoreClockUpdate();
    //PllClock        = PLL_CLOCK;            // PLL
    //SystemCoreClock = PLL_CLOCK / 1;        // HCLK
    //CyclesPerUs     = PLL_CLOCK / 1000000;  // For SYS_SysTickDelay()

    /*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Set GPB multi-function pins for UART0 RXD and TXD */
    //SYS->GPB_MFP &= ~(SYS_GPB_MFP_PB0_Msk | SYS_GPB_MFP_PB1_Msk);
    //SYS->GPB_MFP |= (SYS_GPB_MFP_PB0_UART0_RXD | SYS_GPB_MFP_PB1_UART0_TXD);

    /* Set GPA multi-function pins for PWM0 Channel 0 and PWM1 channel 0 */
    //SYS->GPA_MFP = (SYS->GPA_MFP & (~SYS_GPA_MFP_PA12_Msk));
    //SYS->GPA_MFP |= SYS_GPA_MFP_PA12_PWM0_CH0;

