ZigZagT/FreeCopter/src/wrapper/device/m0518sd2ae/main.c
    //SYS->GPA_MFP = (SYS->GPA_MFP & (~SYS_GPA_MFP_PA2_Msk));
    //SYS->GPA_MFP |= SYS_GPA_MFP_PA2_PWM1_CH0;
    //SYS->ALT_MFP3 &= ~(SYS_ALT_MFP3_PA2_Msk);
    //SYS->ALT_MFP3 |= SYS_ALT_MFP3_PA2_PWM1_CH0;

    // SYS->ALT_MFP = 0x00000000;
    // SYS->ALT_MFP2 = 0x00000000;
    // SYS->ALT_MFP3 = SYS_ALT_MFP3_PF4_PWM1_CH4 | SYS_ALT_MFP3_PD15_BPWM0_CH4 | SYS_ALT_MFP3_PD14_BPWM0_CH5 | SYS_ALT_MFP3_PC3_BPWM0_CH3 | SYS_ALT_MFP3_PC2_BPWM0_CH2 | SYS_ALT_MFP3_PC1_BPWM0_CH1 | SYS_ALT_MFP3_PC0_BPWM0_CH0 | SYS_ALT_MFP3_PB11_PWM0_CH4 | SYS_ALT_MFP3_PA10_PWM1_CH2 | SYS_ALT_MFP3_PA2_PWM1_CH0;
    // SYS->ALT_MFP4 = SYS_ALT_MFP4_PC7_I2C0_SCL | SYS_ALT_MFP4_PC6_I2C0_SDA;
    // SYS->GPA_MFP = SYS_GPA_MFP_PA14_PWM0_CH2 | SYS_GPA_MFP_PA12_PWM0_CH0 | SYS_GPA_MFP_PA10_PWM1_CH2 | SYS_GPA_MFP_PA2_PWM1_CH0;
    // SYS->GPB_MFP = SYS_GPB_MFP_PB11_PWM0_CH4;
    // SYS->GPC_MFP = SYS_GPC_MFP_PC7_I2C0_SCL | SYS_GPC_MFP_PC6_I2C0_SDA | SYS_GPC_MFP_PC3_BPWM0_CH3 | SYS_GPC_MFP_PC2_BPWM0_CH2 | SYS_GPC_MFP_PC1_BPWM0_CH1 | SYS_GPC_MFP_PC0_BPWM0_CH0;
    // SYS->GPD_MFP = SYS_GPD_MFP_PD15_BPWM0_CH4 | SYS_GPD_MFP_PD14_BPWM0_CH5;
    // SYS->GPE_MFP = 0x00000000;
    // SYS->GPF_MFP = SYS_GPF_MFP_PF7_ICE_DAT | SYS_GPF_MFP_PF6_ICE_CLK | SYS_GPF_MFP_PF4_PWM1_CH4;

    SYS->ALT_MFP = 0x00000000;
    SYS->ALT_MFP2 = 0x00000000;
    SYS->ALT_MFP3 = SYS_ALT_MFP3_PF8_BPWM1_CH4 | SYS_ALT_MFP3_PF4_PWM1_CH4 | SYS_ALT_MFP3_PD15_BPWM0_CH4 | SYS_ALT_MFP3_PD7_BPWM1_CH0 | SYS_ALT_MFP3_PC2_BPWM0_CH2 | SYS_ALT_MFP3_PC0_BPWM0_CH0 | SYS_ALT_MFP3_PB11_PWM0_CH4 | SYS_ALT_MFP3_PB8_BPWM1_CH2 | SYS_ALT_MFP3_PA10_PWM1_CH2 | SYS_ALT_MFP3_PA2_PWM1_CH0;
    SYS->ALT_MFP4 = SYS_ALT_MFP4_PC7_I2C0_SCL | SYS_ALT_MFP4_PC6_I2C0_SDA;
    SYS->GPA_MFP = SYS_GPA_MFP_PA14_PWM0_CH2 | SYS_GPA_MFP_PA12_PWM0_CH0 | SYS_GPA_MFP_PA10_PWM1_CH2 | SYS_GPA_MFP_PA2_PWM1_CH0;
    SYS->GPB_MFP = SYS_GPB_MFP_PB11_PWM0_CH4 | SYS_GPB_MFP_PB8_BPWM1_CH2;
    SYS->GPC_MFP = SYS_GPC_MFP_PC7_I2C0_SCL | SYS_GPC_MFP_PC6_I2C0_SDA | SYS_GPC_MFP_PC2_BPWM0_CH2 | SYS_GPC_MFP_PC0_BPWM0_CH0;
    SYS->GPD_MFP = SYS_GPD_MFP_PD15_BPWM0_CH4 | SYS_GPD_MFP_PD7_BPWM1_CH0;
    SYS->GPE_MFP = 0x00000000;
    SYS->GPF_MFP = SYS_GPF_MFP_PF7_ICE_DAT | SYS_GPF_MFP_PF6_ICE_CLK | SYS_GPF_MFP_PF4_PWM1_CH4;

    #if defined(DEBUG)
    printf("Clock Dump:\n");
    printf("\tCPU Freq:\t%d\n", CLK_GetCPUFreq());
    printf("\tHCLK Freq:\t%d\n", CLK_GetHCLKFreq());
    printf("\tHXT Freq:\t%d\n", CLK_GetHXTFreq());
    printf("\tPCLK Freq:\t%d\n", CLK_GetPCLKFreq());
    printf("\tPLL Freq:\t%d\n", CLK_GetPLLClockFreq());
    #endif
}

void PWM_INIT( void ) {
    int temp;
    int clock_src;
    int clock_freq;

    /* Reset PWM */
    SYS_ResetModule(PWM0_RST);
    SYS_ResetModule(PWM1_RST);
    SYS_ResetModule(BPWM0_RST);
    SYS_ResetModule(BPWM1_RST);

    //CLK_SetHCLK(CLK_CLKSEL0_HCLK_S_HXT, CLK_CLKDIV_HCLK(1));
    clock_src = CLK->CLKSEL3 & CLK_CLKSEL3_PWM0_S_Msk;

    if(clock_src == 0)
    {
        //clock source is from PLL clock
        clock_freq = CLK_GetPLLClockFreq();
        #if defined(DEBUG)
        printf("PWM Clock is set to PLL clock\n");
        #endif
    }
    else
    {
        //clock source is from PCLK
        //SystemCoreClockUpdate();
        //clock_freq = SystemCoreClock;
        clock_freq = CLK_GetPCLKFreq();
        #if defined(DEBUG)
        printf("PWM Clock is set to PCLK\n");
        #endif
    }

    #if defined(DEBUG)
    printf("PWM Clock Freq: %d\n", clock_freq);
    #endif

    // init clock
    PWM_Cycle_Per_US = (double)clock_freq / (double)(PWM_GLOBAL_PRESCALE + 1) / 1000.00 / 1000.00;
    PWM_NS_Per_Cycle = (int) (1000.00 / PWM_Cycle_Per_US);
    PWM_Cycle_Per_Period = (int) (PWM_Cycle_Per_US * PWM_PERIOD_LIMIT_US);
    PWM_Cycle_Low_Bound = (int) (PWM_Cycle_Per_US * PWM_LOW_BOUND_US);
    PWM_Cycle_Hi_Bound = (int) (PWM_Cycle_Per_US * PWM_HI_BLUND_US);
    PWM_Cycle_Per_Period_Limit = (int) (PWM_Cycle_Per_US * PWM_PERIOD_US);
    PWM_Cycle_Low_Bound_Limit = (int) (PWM_Cycle_Per_US * PWM_LOW_BOUND_LIMIT_US);
    PWM_Cycle_Hi_Bound_Limit = (int) (PWM_Cycle_Per_US * PWM_HI_BOUND_LIMIT_US);

    // for (temp = 0; temp < 6; ++temp) {
    //     BPWM_ConfigOutputChannel(BPWM0, temp, 250, 30);

    //     BPWM_SET_PRESCALER(BPWM0, temp, PWM_GLOBAL_PRESCALE);
    //     BPWM_SET_CNR(BPWM0, temp, PWM_Cycle_Per_Period);
    //     BPWM_SET_CMR(BPWM0, temp, PWM_Cycle_Low_Bound);
    //     #if defined(DEBUG)
    //     printf("BPWM0 CH %d CMR: %d, CNR: %d\n", temp, PWM_Cycle_Hi_Bound, PWM_Cycle_Per_Period);
    //     #endif
    // }
    // BPWM_EnableOutput(BPWM0, BPWM_CH_0_MASK | BPWM_CH_1_MASK | BPWM_CH_2_MASK | BPWM_CH_3_MASK | BPWM_CH_4_MASK | BPWM_CH_5_MASK);
    // BPWM_Start(BPWM0, BPWM_CH_0_MASK | BPWM_CH_1_MASK | BPWM_CH_2_MASK | BPWM_CH_3_MASK | BPWM_CH_4_MASK | BPWM_CH_5_MASK);

    // init pin
    for (temp = 0; temp < 6; temp+=2) {
        PWM_ConfigCaptureChannel(PWM0, temp, PWM_NS_Per_Cycle, 0);
        PWM_ConfigCaptureChannel(PWM1, temp, PWM_NS_Per_Cycle, 0);
        BPWM_ConfigOutputChannel(BPWM0, temp, 250, 30);
        BPWM_ConfigOutputChannel(BPWM1, temp, 250, 30);

        PWM_SET_PRESCALER(PWM0, temp, PWM_GLOBAL_PRESCALE);
        PWM_SET_PRESCALER(PWM1, temp, PWM_GLOBAL_PRESCALE);
        BPWM_SET_PRESCALER(BPWM0, temp, PWM_GLOBAL_PRESCALE);
        BPWM_SET_PRESCALER(BPWM1, temp, PWM_GLOBAL_PRESCALE);

        BPWM_SET_CNR(BPWM0, temp, PWM_Cycle_Per_Period);
        BPWM_SET_CMR(BPWM0, temp, PWM_Cycle_Low_Bound);
        BPWM_SET_CNR(BPWM1, temp, PWM_Cycle_Per_Period);
        BPWM_SET_CMR(BPWM1, temp, PWM_Cycle_Low_Bound);
    }

    // init capture
    PWM_Start(PWM0, PWM_CH_0_MASK | PWM_CH_2_MASK | PWM_CH_4_MASK);
    PWM_Start(PWM1, PWM_CH_0_MASK | PWM_CH_2_MASK | PWM_CH_4_MASK);

    PWM_EnableCapture(PWM0, PWM_CH_0_MASK | PWM_CH_2_MASK | PWM_CH_4_MASK);
    PWM_EnableCapture(PWM1, PWM_CH_0_MASK | PWM_CH_2_MASK | PWM_CH_4_MASK);

    PWM0->CAPCTL |= PWM_CAPCTL_FCRLDEN0_Msk | PWM_CAPCTL_FCRLDEN2_Msk | PWM_CAPCTL_FCRLDEN4_Msk;
    PWM1->CAPCTL |= PWM_CAPCTL_FCRLDEN0_Msk | PWM_CAPCTL_FCRLDEN2_Msk | PWM_CAPCTL_FCRLDEN4_Msk;

    while((PWM0->CNT[0]) == 0 || (PWM0->CNT[2]) == 0 || (PWM0->CNT[4]) == 0);
    while((PWM1->CNT[0]) == 0 || (PWM1->CNT[2]) == 0 || (PWM1->CNT[4]) == 0);

    // init output
    BPWM_EnableOutput(BPWM0, BPWM_CH_0_MASK | BPWM_CH_2_MASK | BPWM_CH_4_MASK);
    BPWM_EnableOutput(BPWM1, BPWM_CH_0_MASK | BPWM_CH_2_MASK | BPWM_CH_4_MASK);

    BPWM_Start(BPWM0, BPWM_CH_0_MASK | BPWM_CH_2_MASK | BPWM_CH_4_MASK);
    BPWM_Start(BPWM1, BPWM_CH_0_MASK | BPWM_CH_2_MASK | BPWM_CH_4_MASK);


    fc_wcp_status_channels.channel_n = 6;
    fc_wcp_status_channels.channel[0].name = FREECOPTER_WCP_CHANNEL_AILERON;
    fc_wcp_status_channels.channel[0].signal_source = FREECOPTER_WCP_CHANNEL_SIGSOURCE_FORWARD;
    fc_wcp_status_channels.channel[1].name = FREECOPTER_WCP_CHANNEL_ELEVATOR;
    fc_wcp_status_channels.channel[1].signal_source = FREECOPTER_WCP_CHANNEL_SIGSOURCE_FORWARD;
    fc_wcp_status_channels.channel[2].name = FREECOPTER_WCP_CHANNEL_THROTTLE;
    fc_wcp_status_channels.channel[2].signal_source = FREECOPTER_WCP_CHANNEL_SIGSOURCE_FORWARD;
    fc_wcp_status_channels.channel[3].name = FREECOPTER_WCP_CHANNEL_RUDDER;
    fc_wcp_status_channels.channel[3].signal_source = FREECOPTER_WCP_CHANNEL_SIGSOURCE_FORWARD;
    fc_wcp_status_channels.channel[4].name = FREECOPTER_WCP_CHANNEL_USER1;
    fc_wcp_status_channels.channel[4].signal_source = FREECOPTER_WCP_CHANNEL_SIGSOURCE_FORWARD;
    fc_wcp_status_channels.channel[5].name = FREECOPTER_WCP_CHANNEL_USER2;
    fc_wcp_status_channels.channel[5].signal_source = FREECOPTER_WCP_CHANNEL_SIGSOURCE_FORWARD;

