ZigZagT/FreeCopter/src/wrapper/device/m0518sd2ae/main.c
    memset(&pwm_history, 0, sizeof(pwm_history));

    // init IRQ
    NVIC_EnableIRQ(PWM0_IRQn);
    NVIC_EnableIRQ(PWM1_IRQn);

    Enable_PWM0_INT();
    Enable_PWM1_INT();


    // (PWM0->CAPIEN |= 0x3f << 6);
    // (PWM1->CAPIEN |= 0x3f << 6);
    //(PWM0->CAPIEN &= ~(0x3f << 6))
    //(PWM1->CAPIEN &= ~(0x3f << 6))


}

void I2C_RESET(void) {
    // Reset I2C
    SYS_ResetModule(I2C0_RST);

    /* Open I2C module and set bus clock */
    I2C_Open(I2C0, 100000);

    /* Set I2C 4 Slave Addresses */
    I2C_SetSlaveAddr(I2C0, 0, 0x15, 0);   /* Slave Address : 0x15 */
    I2C_SetSlaveAddr(I2C0, 1, 0x35, 0);   /* Slave Address : 0x35 */
    I2C_SetSlaveAddr(I2C0, 2, 0x55, 0);   /* Slave Address : 0x55 */
    I2C_SetSlaveAddr(I2C0, 3, 0x75, 0);   /* Slave Address : 0x75 */

    /* Set I2C 4 Slave Addresses Mask */
    /*
    I2C_SetSlaveAddrMask(I2C0, 0, 0x01);
    I2C_SetSlaveAddrMask(I2C0, 1, 0x04);
    I2C_SetSlaveAddrMask(I2C0, 2, 0x01);
    I2C_SetSlaveAddrMask(I2C0, 3, 0x04);
    */


    //I2C_SEND_RESET(&I2C_Send_Control);
    //I2C_RECV_RESET(&I2C_Recv_Control);

    I2C_SET_FLAG(&I2C_Send_Control, I2C_FLAG_SEND_REPEAT);
    I2C_SET_FLAG(&I2C_Recv_Control, I2C_FLAG_FORCE_FLUSH);

    /* Enable I2C interrupt */

    I2C_EnableInt(I2C0);
    NVIC_EnableIRQ(I2C0_IRQn);
    I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_SI_AA);

}

void I2C_INIT(void)
{
    I2C_SEND_INIT(&I2C_Send_Control, 200);
    I2C_RECV_INIT(&I2C_Recv_Control, 200);

    fc_wcp_status_transfer = FREECOPTER_WCP_STATUS_TRANSFER_IDLE;
    memset(&fc_wcp_status_transfer_header, 0, sizeof(fc_wcp_status_transfer_header));
    fc_wcp_status_transfer_progress = 0;

    fc_wcp_status_timeout_count = 0x0000ffff;
    fc_wcp_status_timeout_reload = 0x0000ffff;

    fc_wcp_status_channels_control_expires = 0x0000ffff;
    fc_wcp_status_channels_control_expires_reload  = 0x0000ffff;
    memset(&fc_wcp_status_channels, 0, sizeof(fc_wcp_status_channels));

    I2C_RESET();
}

void I2C_Slave_Go(I2C_T* port, uint32_t status) {
    uint8_t temp_data;
    uint32_t temp;
    fc_wcp_send_recv_data_args_t send_args = {status, NULL, port, &temp_data};
    int res;

    #if defined(DEBUG)
    printf("I2C_Slave_Go 0x%X!\n", status);
    #endif

    // if(status != 0x60 && status != 0x80 && status != 0xa0 && status != 0xf8) {
    //     printf("I2C status 0x%X\n", status);
    // }
    switch (status) {
        case I2C_STATUS_SLAVE_RESTART_STOP:       // slave receive finished
        //I2C_Flush_Recv_Data(&I2C_Recv_Control);
        I2C_RESET();
        break;

        case I2C_STATUS_SLAVE_RECV_DATA_NACK:
        fc_log("I2C_STATUS_SLAVE_RECV_DATA_NACK");
        // I2C_Flush_Recv_Data(&I2C_Recv_Control);
        I2C_SET_CONTROL_REG(port, I2C_I2CON_SI_AA);
        break;

        // case I2C_STATUS_SLAVE_SEND_DATA_NACK:
        //      // master indecate to interrupt send
        // I2C_SET_CONTROL_REG(port, I2C_I2CON_SI_AA);
        // break;

        // case I2C_STATUS_SLAVE_SEND_LAST_DATA_ACK: // seems never occurs
        // printf("I2C_STATUS_SLAVE_SEND_LAST_DATA_ACK\n");
        // I2C_SET_CONTROL_REG(port, I2C_I2CON_SI_AA);
        // I2C_Flush_Send_Data(&I2C_Send_Control);
        // break;

        case I2C_STATUS_SLAVE_SEND_DATA_NACK:
        case I2C_STATUS_SLAVE_SEND_LAST_DATA_ACK:
        case I2C_STATUS_SLAVE_SEND_ADDR_ACK:
        case I2C_STATUS_SLAVE_SEND_DATA_ACK:
        send_args.target = &I2C_Send_Control;
        res = fc_wcp_send_data((unsigned long)&send_args);
        I2C_SET_CONTROL_REG(port, I2C_I2CON_SI_AA);
        if (status == I2C_STATUS_SLAVE_SEND_LAST_DATA_ACK) {
            printf("I2C_STATUS_SLAVE_SEND_LAST_DATA_ACK occurs\n");
        }
        break;

        case I2C_STATUS_SLAVE_RECV_ADDR_ACK:
        I2C_SET_CONTROL_REG(port, I2C_I2CON_SI_AA);
        break;

        case I2C_STATUS_SLAVE_RECV_DATA_ACK:
        I2C_Recv_Byte(&I2C_Recv_Control, port, &temp_data);
        ++fc_wcp_status_transfer_progress;
        fc_wcp_status_timeout_count = fc_wcp_status_timeout_reload;
        switch (fc_wcp_status_transfer) {
            case FREECOPTER_WCP_STATUS_TRANSFER_IDLE:
            case FREECOPTER_WCP_STATUS_TRANSFER_SEND_HEADER:
            case FREECOPTER_WCP_STATUS_TRANSFER_SEND:

            fc_wcp_status_transfer_progress = 0;
            fc_wcp_status_transfer_header.command = temp_data;
            if (fc_wcp_status_transfer_header.command == FREECOPTER_WCP_COMMAND_SET_STATUS) {
                fc_wcp_status_transfer = FREECOPTER_WCP_STATUS_TRANSFER_RECV_HEADER;
            } else if (fc_wcp_status_transfer_header.command == FREECOPTER_WCP_COMMAND_GET_STATUS) {
                fc_wcp_status_transfer = FREECOPTER_WCP_STATUS_TRANSFER_SEND_HEADER;
                fc_wcp_status_transfer_header.data_length = sizeof(FREECOPTER_WCP_STATUS_T);
                temp = 4;
                I2C_Set_Send_Data(&I2C_Send_Control, (uint8_t*)&fc_wcp_status_transfer_header.data_length, &temp);
                I2C_Flush_Send_Data(&I2C_Send_Control);
            } else if (fc_wcp_status_transfer_header.command == FREECOPTER_WCP_COMMAND_NONE){
                fc_wcp_status_transfer = FREECOPTER_WCP_STATUS_TRANSFER_IDLE;
            } else {
                fc_wcp_status_transfer = FREECOPTER_WCP_STATUS_TRANSFER_IDLE;
            }
            I2C_RECV_RESET(&I2C_Recv_Control);
            I2C_SEND_RESET(&I2C_Send_Control);
            break;

            case FREECOPTER_WCP_STATUS_TRANSFER_RECV_HEADER:
            if (fc_wcp_status_transfer_progress == 4) {
                fc_wcp_status_transfer_progress = 0;
                fc_wcp_status_transfer_header.data_length = *((uint32_t*)(I2C_Recv_Control.pending_data_buf));

                fc_wcp_status_transfer = FREECOPTER_WCP_STATUS_TRANSFER_RECV;
                I2C_RECV_RESET(&I2C_Recv_Control);
            }
            break;

            case FREECOPTER_WCP_STATUS_TRANSFER_RECV:
            if (fc_wcp_status_transfer_progress >= fc_wcp_status_transfer_header.data_length) {
                I2C_Flush_Recv_Data(&I2C_Recv_Control);
                fc_wcp_status_transfer_progress = 0;
                fc_wcp_status_transfer = FREECOPTER_WCP_STATUS_TRANSFER_IDLE;
                fc_wcp_update_channel_status((unsigned long)&I2C_Recv_Control);
            }
            break;
            default:
            fc_log("fc_wcp_status_transfer not set");
            break;
        }
        I2C_SET_CONTROL_REG(port, I2C_I2CON_SI_AA);
        //printf("data %X received, progress %d, status %d.\n", temp_data, fc_wcp_status_transfer_progress, fc_wcp_status_transfer);
        break;

        case I2C_STATUS_SLAVE_RECV_ARBI_LOST:
        case I2C_STATUS_SLAVE_SEND_ARBI_LOST:

