ZigZagT/FreeCopter/src/wrapper/device/m0518sd2ae/main.c
        case I2C_STATUS_GC_ADDR_ACK:
        case I2C_STATUS_GC_ARBI_LOST:
        case I2C_STATUS_GC_DATA_ACK:
        case I2C_STATUS_GC_DATA_NACK:

        case I2C_STATUS_BUS_ERROR:
        case I2C_STATUS_BUS_FREE:

        case I2C_STATUS_MASTER_START:
        case I2C_STATUS_MASTER_RESTART:
        case I2C_STATUS_MASTER_SEND_ADDR_ACK:
        case I2C_STATUS_MASTER_SEND_ADDR_NACK:
        case I2C_STATUS_MASTER_SEND_DATA_ACK:
        case I2C_STATUS_MASTER_SEND_DATA_NACK:
        case I2C_STATUS_MASTER_ARBI_LOST:
        case I2C_STATUS_MASTER_RECV_ADDR_ACK:
        case I2C_STATUS_MASTER_RECV_ADDR_NACK:
        case I2C_STATUS_MASTER_RECV_DATA_ACK:
        case I2C_STATUS_MASTER_RECV_DATA_NACK:

        default:
        //printf("I2C status 0x%X\n", status);
        I2C_RESET();
        break;
    }
}

void fc_log(char* msg) {
    #if defined(DEBUG)
    printf("fc-log: %s\n", msg);
    #else
    #endif
}

int32_t main(void)
{
    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Init System, IP clock and multi-function I/O */
    SYS_Init();

    /* Lock protected registers */
    SYS_LockReg();
    I2C_INIT();
    // iniialize pwm after i2c
    PWM_INIT();
    #if defined(DEBUG)
    printf("main: 0x%X started.\n", &main);

    //Disable_PWM0_INT();
    //Disable_PWM1_INT();

    //BPWM_SET_CNR(BPWM0, 0, PWM_Cycle_Per_Period);
    //BPWM_SET_CMR(BPWM0, 0, 2000 * PWM_Cycle_Per_US);
    //BPWM_SET_CMR(BPWM0, 1, 1500 * PWM_Cycle_Per_US);
    //printf("press any key to get status message\n");
    #endif
    while (1) {
        fc_wcp_loop();
    //     if (I2C_TEST_FLAG(&I2C_Recv_Control, I2C_FLAG_FLUSH)) {
    //
    //         I2C_Get_Recv_Data(&I2C_Recv_Control, buf + 7, &buf_len);
    //         --buf_len;
    //         memcpy(buf, "echo: [", 7);
    //         buf_len += 7;
    //         buf[buf_len] = ']';
    //         buf[buf_len + 1] = '\0';
    //         buf_len += 2;
    //
    //         if (buf_len > 12) {
    //             //printf("%s\n", buf);
    //             I2C_Set_Send_Data(&I2C_Send_Control, buf, &buf_len);
    //             I2C_Flush_Send_Data(&I2C_Send_Control);
    //         }
    //         buf_len = buf_cap;
    //     }
    }

    /*
    Don't care about close pwm and i2c
    */
}
